CSI API ETABS v1
cDatabaseTables Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDatabaseTables
Public Interface cDatabaseTables
Dim instance As cDatabaseTables
public interface class cDatabaseTables
type cDatabaseTables =  interface end
The cDatabaseTables type exposes the following members.
Methods
Name | Description
ApplyEditedTables
 Instructs the program to interactively import all of the tables stored in the table list using the SetTableForEditing... functions.
CancelTableEditing
 Clears all tables that were stored in the table list using one of the SetTableForEditing... functions.
GetAllFieldsInTable
 Returns the available fields in a specified table.
GetAllTables
 Returns all of the tables along with their import type and indicates if any data is available in the model to fill the table.
GetAvailableTables
 Returns the tables that are currently available for display.
GetLoadCasesSelectedForDisplay
 Returns a list of load cases that are selected for table display.
GetLoadCombinationsSelectedForDisplay
 Returns a list of load combinations that are selected for table display.
GetLoadPatternsSelectedForDisplay
 Returns a list of load patterns that are selected for table display.
GetObsoleteTableKeyList
 Returns a list of obsolete table keys for the program.
GetOutputOptionsForDisplay
 Returns the database table output options for load case results.
GetTableForDisplayArray
 Returns data for a single table in a single array. If there is nothing to be shown in the table then no data is returned.
GetTableForDisplayCSVFile
 Returns data for a single table in a CSV file. If there is nothing to be shown in the table then no data is returned.
GetTableForDisplayCSVString
 Returns data for a single table in a CSV string. If there is nothing to be shown in the table then no data is returned.
GetTableForDisplayXMLString
 Returns data for a single table as XML in a single string. If there is nothing to be shown in the table then no data is returned.
GetTableForEditingArray
 Returns a single table in a string array for interactive editing.
GetTableForEditingCSVFile
 Returns a single table in a CSV file for interactive editing.
GetTableForEditingCSVString
 Returns a single table in a CSV-formatted string for interactive editing.
SetLoadCasesSelectedForDisplay
 Sets the load cases that are selected for table display.
SetLoadCombinationsSelectedForDisplay
 Sets the load combinations that are selected for table display.
SetLoadPatternsSelectedForDisplay
 Sets the load patterns that are selected for table display.
SetOutputOptionsForDisplay
 Sets the database table output options for load case results.
SetTableForEditingArray
 Reads a table from a string array and adds it to a stored table list until either the ApplyEditedTables(Boolean, Int32, Int32, Int32, Int32, String) or CancelTableEditing() command is issued.
SetTableForEditingCSVFile
 Reads a table from a CSV file and adds it to a stored table list until either the ApplyEditedTables(Boolean, Int32, Int32, Int32, Int32, String) or CancelTableEditing() command is issued.
SetTableForEditingCSVString
 Reads a table from a CSV-formatted string and adds it to a stored table list until either the ApplyEditedTables(Boolean, Int32, Int32, Int32, Int32, String) or CancelTableEditing() command is issued.
ShowTablesInExcel
 Exports the specified tables to Excel.
Top
See Also
Reference
ETABSv1 Namespace